codedFixedValue/system/NACA0021_multiRe_cd
// From Sheldahl and Klimas (1981)
// Re_c = 40000 80000 160000 360000 700000 1000000 2000000 5000000
// alpha_deg
(-180.0 0.0250 0.0250 0.0250 0.0250 0.0250 0.0250 0.0250 0.0250)
(-175.0 0.0550 0.0550 0.0550 0.0550 0.0550 0.0550 0.0550 0.0550)
(-170.0 0.1400 0.1400 0.1400 0.1400 0.1400 0.1400 0.1400 0.1400)
(-165.0 0.2300 0.2300 0.2300 0.2300 0.2300 0.2300 0.2300 0.2300)
(-160.0 0.3200 0.3200 0.3200 0.3200 0.3200 0.3200 0.3200 0.3200)
(-155.0 0.4200 0.4200 0.4200 0.4200 0.4200 0.4200 0.4200 0.4200)
(-150.0 0.5750 0.5750 0.5750 0.5750 0.5750 0.5750 0.5750 0.5750)
(-145.0 0.7550 0.7550 0.7550 0.7550 0.7550 0.7550 0.7550 0.7550)
(-140.0 0.9250 0.9250 0.9250 0.9250 0.9250 0.9250 0.9250 0.9250)
(-135.0 1.0850 1.0850 1.0850 1.0850 1.0850 1.0850 1.0850 1.0850)
(-130.0 1.2250 1.2250 1.2250 1.2250 1.2250 1.2250 1.2250 1.2250)
(-125.0 1.3500 1.3500 1.3500 1.3500 1.3500 1.3500 1.3500 1.3500)
(-120.0 1.4650 1.4650 1.4650 1.4650 1.4650 1.4650 1.4650 1.4650)
(-115.0 1.5550 1.5550 1.5550 1.5550 1.5550 1.5550 1.5550 1.5550)
(-110.0 1.6350 1.6350 1.6350 1.6350 1.6350 1.6350 1.6350 1.6350)
(-105.0 1.7000 1.7000 1.7000 1.7000 1.7000 1.7000 1.7000 1.7000)
(-100.0 1.7500 1.7500 1.7500 1.7500 1.7500 1.7500 1.7500 1.7500)
(-95.0 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800)
(-90.0 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000)
(-85.0 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000)
(-80.0 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800)
(-75.0 1.7350 1.7350 1.7350 1.7350 1.7350 1.7350 1.7350 1.7350)
(-70.0 1.6650 1.6650 1.6650 1.6650 1.6650 1.6650 1.6650 1.6650)
(-65.0 1.5750 1.5750 1.5750 1.5750 1.5750 1.5750 1.5750 1.5750)
(-60.0 1.4700 1.4700 1.4700 1.4700 1.4700 1.4700 1.4700 1.4700)
(-55.0 1.3450 1.3450 1.3450 1.3450 1.3450 1.3450 1.3450 1.3450)
(-50.0 1.2150 1.2150 1.2150 1.2150 1.2150 1.2150 1.2150 1.2150)
(-45.0 1.0750 1.0750 1.0750 1.0750 1.0750 1.0750 1.0750 1.0750)
(-40.0 0.9200 0.9200 0.9200 0.9200 0.9200 0.9200 0.9200 0.9200)
(-35.0 0.7450 0.7450 0.7450 0.7450 0.7450 0.7450 0.7450 0.7450)
(-30.0 0.5700 0.5700 0.5700 0.5700 0.5700 0.5700 0.5700 0.5700)
(-25.0 0.4050 0.4050 0.4050 0.4050 0.4050 0.4050 0.4050 0.4050)
(-22.0 0.3290 0.3290 0.3290 0.3290 0.3290 0.3290 0.3290 0.3290)
(-21.0 0.3055 0.3055 0.3055 0.3055 0.3055 0.3055 0.3055 0.1792)
(-20.0 0.2820 0.2820 0.2820 0.2820 0.2820 0.2820 0.2820 0.0293)
(-19.0 0.2600 0.2600 0.2600 0.2600 0.2600 0.2085 0.1450 0.0268)
(-18.0 0.2380 0.2380 0.2380 0.2380 0.2380 0.1350 0.0285 0.0245)
(-17.0 0.2170 0.2170 0.2170 0.2170 0.1250 0.0300 0.0260 0.0224)
(-16.0 0.1960 0.1960 0.1960 0.1960 0.0295 0.0273 0.0236 0.0205)
(-15.0 0.1770 0.1770 0.1770 0.1040 0.0269 0.0248 0.0215 0.0186)
(-14.0 0.1580 0.1580 0.1580 0.0286 0.0244 0.0226 0.0196 0.0170)
(-13.0 0.1405 0.1405 0.0860 0.0260 0.0223 0.0206 0.0179 0.0156)
(-12.0 0.1230 0.1230 0.0292 0.0237 0.0202 0.0187 0.0162 0.0143)
(-11.0 0.0925 0.0700 0.0266 0.0215 0.0184 0.0170 0.0148 0.0132)
(-10.0 0.0620 0.0297 0.0243 0.0195 0.0166 0.0154 0.0135 0.0121)
(-9.0 0.0343 0.0273 0.0222 0.0178 0.0152 0.0140 0.0124 0.0112)
(-8.0 0.0319 0.0252 0.0204 0.0163 0.0138 0.0128 0.0114 0.0104)
(-7.0 0.0297 0.0233 0.0187 0.0149 0.0126 0.0117 0.0105 0.0097)
(-6.0 0.0279 0.0217 0.0174 0.0138 0.0117 0.0108 0.0098 0.0091)
(-5.0 0.0264 0.0204 0.0163 0.0129 0.0109 0.0101 0.0092 0.0086)
(-4.0 0.0253 0.0194 0.0155 0.0122 0.0103 0.0096 0.0089 0.0083)
(-3.0 0.0243 0.0186 0.0148 0.0117 0.0098 0.0092 0.0086 0.0081)
(-2.0 0.0237 0.0181 0.0143 0.0113 0.0096 0.0090 0.0084 0.0079)
(-1.0 0.0233 0.0178 0.0140 0.0111 0.0094 0.0089 0.0083 0.0078)
(0.0 0.0232 0.0177 0.0139 0.0111 0.0094 0.0089 0.0082 0.0078)
(1.0 0.0233 0.0178 0.0140 0.0111 0.0094 0.0089 0.0083 0.0078)
(2.0 0.0237 0.0181 0.0143 0.0113 0.0096 0.0090 0.0084 0.0079)
(3.0 0.0243 0.0186 0.0148 0.0117 0.0098 0.0092 0.0086 0.0081)
(4.0 0.0253 0.0194 0.0155 0.0122 0.0103 0.0096 0.0089 0.0083)
(5.0 0.0264 0.0204 0.0163 0.0129 0.0109 0.0101 0.0092 0.0086)
(6.0 0.0279 0.0217 0.0174 0.0138 0.0117 0.0108 0.0098 0.0091)
(7.0 0.0297 0.0233 0.0187 0.0149 0.0126 0.0117 0.0105 0.0097)
(8.0 0.0319 0.0252 0.0204 0.0163 0.0138 0.0128 0.0114 0.0104)
(9.0 0.0343 0.0273 0.0222 0.0178 0.0152 0.0140 0.0124 0.0112)
(10.0 0.0620 0.0297 0.0243 0.0195 0.0166 0.0154 0.0135 0.0121)
(11.0 0.0925 0.0700 0.0266 0.0215 0.0184 0.0170 0.0148 0.0132)
(12.0 0.1230 0.1230 0.0292 0.0237 0.0202 0.0187 0.0162 0.0143)
(13.0 0.1405 0.1405 0.0860 0.0260 0.0223 0.0206 0.0179 0.0156)
(14.0 0.1580 0.1580 0.1580 0.0286 0.0244 0.0226 0.0196 0.0170)
(15.0 0.1770 0.1770 0.1770 0.1040 0.0269 0.0248 0.0215 0.0186)
(16.0 0.1960 0.1960 0.1960 0.1960 0.0295 0.0273 0.0236 0.0205)
(17.0 0.2170 0.2170 0.2170 0.2170 0.1250 0.0300 0.0260 0.0224)
(18.0 0.2380 0.2380 0.2380 0.2380 0.2380 0.1350 0.0285 0.0245)
(19.0 0.2600 0.2600 0.2600 0.2600 0.2600 0.2085 0.1450 0.0268)
(20.0 0.2820 0.2820 0.2820 0.2820 0.2820 0.2820 0.2820 0.0293)
(21.0 0.3055 0.3055 0.3055 0.3055 0.3055 0.3055 0.3055 0.1792)
(22.0 0.3290 0.3290 0.3290 0.3290 0.3290 0.3290 0.3290 0.3290)
(25.0 0.4050 0.4050 0.4050 0.4050 0.4050 0.4050 0.4050 0.4050)
(30.0 0.5700 0.5700 0.5700 0.5700 0.5700 0.5700 0.5700 0.5700)
(35.0 0.7450 0.7450 0.7450 0.7450 0.7450 0.7450 0.7450 0.7450)
(40.0 0.9200 0.9200 0.9200 0.9200 0.9200 0.9200 0.9200 0.9200)
(45.0 1.0750 1.0750 1.0750 1.0750 1.0750 1.0750 1.0750 1.0750)
(50.0 1.2150 1.2150 1.2150 1.2150 1.2150 1.2150 1.2150 1.2150)
(55.0 1.3450 1.3450 1.3450 1.3450 1.3450 1.3450 1.3450 1.3450)
(60.0 1.4700 1.4700 1.4700 1.4700 1.4700 1.4700 1.4700 1.4700)
(65.0 1.5750 1.5750 1.5750 1.5750 1.5750 1.5750 1.5750 1.5750)
(70.0 1.6650 1.6650 1.6650 1.6650 1.6650 1.6650 1.6650 1.6650)
(75.0 1.7350 1.7350 1.7350 1.7350 1.7350 1.7350 1.7350 1.7350)
(80.0 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800)
(85.0 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000)
(90.0 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000 1.8000)
(95.0 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800 1.7800)
(100.0 1.7500 1.7500 1.7500 1.7500 1.7500 1.7500 1.7500 1.7500)
(105.0 1.7000 1.7000 1.7000 1.7000 1.7000 1.7000 1.7000 1.7000)
(110.0 1.6350 1.6350 1.6350 1.6350 1.6350 1.6350 1.6350 1.6350)
(115.0 1.5550 1.5550 1.5550 1.5550 1.5550 1.5550 1.5550 1.5550)
(120.0 1.4650 1.4650 1.4650 1.4650 1.4650 1.4650 1.4650 1.4650)
(125.0 1.3500 1.3500 1.3500 1.3500 1.3500 1.3500 1.3500 1.3500)
(130.0 1.2250 1.2250 1.2250 1.2250 1.2250 1.2250 1.2250 1.2250)
(135.0 1.0850 1.0850 1.0850 1.0850 1.0850 1.0850 1.0850 1.0850)
(140.0 0.9250 0.9250 0.9250 0.9250 0.9250 0.9250 0.9250 0.9250)
(145.0 0.7550 0.7550 0.7550 0.7550 0.7550 0.7550 0.7550 0.7550)
(150.0 0.5750 0.5750 0.5750 0.5750 0.5750 0.5750 0.5750 0.5750)
(155.0 0.4200 0.4200 0.4200 0.4200 0.4200 0.4200 0.4200 0.4200)
(160.0 0.3200 0.3200 0.3200 0.3200 0.3200 0.3200 0.3200 0.3200)
(165.0 0.2300 0.2300 0.2300 0.2300 0.2300 0.2300 0.2300 0.2300)
(170.0 0.1400 0.1400 0.1400 0.1400 0.1400 0.1400 0.1400 0.1400)
(175.0 0.0550 0.0550 0.0550 0.0550 0.0550 0.0550 0.0550 0.0550)
(180.0 0.0250 0.0250 0.0250 0.0250 0.0250 0.0250 0.0250 0.0250)
