codedFixedValue/system/NACA0021_multiRe_cl
// From Sheldahl and Klimas (1981)
// Re_c = 40000 80000 160000 360000 700000 1000000 2000000 5000000
// alpha_deg
(-180.0 -0.0000 -0.0000 -0.0000 -0.0000 -0.0000 -0.0000 -0.0000 -0.0000)
(-175.0 0.6600 0.6600 0.6600 0.6600 0.6600 0.6600 0.6600 0.6600)
(-170.0 0.8500 0.8500 0.8500 0.8500 0.8500 0.8500 0.8500 0.8500)
(-165.0 0.6800 0.6800 0.6800 0.6800 0.6800 0.6800 0.6800 0.6800)
(-160.0 0.6350 0.6350 0.6350 0.6350 0.6350 0.6350 0.6350 0.6350)
(-155.0 0.6700 0.6700 0.6700 0.6700 0.6700 0.6700 0.6700 0.6700)
(-150.0 0.7700 0.7700 0.7700 0.7700 0.7700 0.7700 0.7700 0.7700)
(-145.0 0.9000 0.9000 0.9000 0.9000 0.9000 0.9000 0.9000 0.9000)
(-140.0 0.9800 0.9800 0.9800 0.9800 0.9800 0.9800 0.9800 0.9800)
(-135.0 0.9300 0.9300 0.9300 0.9300 0.9300 0.9300 0.9300 0.9300)
(-130.0 0.8500 0.8500 0.8500 0.8500 0.8500 0.8500 0.8500 0.8500)
(-125.0 0.7600 0.7600 0.7600 0.7600 0.7600 0.7600 0.7600 0.7600)
(-120.0 0.6700 0.6700 0.6700 0.6700 0.6700 0.6700 0.6700 0.6700)
(-115.0 0.5750 0.5750 0.5750 0.5750 0.5750 0.5750 0.5750 0.5750)
(-110.0 0.4500 0.4500 0.4500 0.4500 0.4500 0.4500 0.4500 0.4500)
(-105.0 0.3200 0.3200 0.3200 0.3200 0.3200 0.3200 0.3200 0.3200)
(-100.0 0.1850 0.1850 0.1850 0.1850 0.1850 0.1850 0.1850 0.1850)
(-95.0 0.0500 0.0500 0.0500 0.0500 0.0500 0.0500 0.0500 0.0500)
(-90.0 -0.0900 -0.0900 -0.0900 -0.0900 -0.0900 -0.0900 -0.0900 -0.0900)
(-85.0 -0.2300 -0.2300 -0.2300 -0.2300 -0.2300 -0.2300 -0.2300 -0.2300)
(-80.0 -0.3650 -0.3650 -0.3650 -0.3650 -0.3650 -0.3650 -0.3650 -0.3650)
(-75.0 -0.5000 -0.5000 -0.5000 -0.5000 -0.5000 -0.5000 -0.5000 -0.5000)
(-70.0 -0.6300 -0.6300 -0.6300 -0.6300 -0.6300 -0.6300 -0.6300 -0.6300)
(-65.0 -0.7600 -0.7600 -0.7600 -0.7600 -0.7600 -0.7600 -0.7600 -0.7600)
(-60.0 -0.8750 -0.8750 -0.8750 -0.8750 -0.8750 -0.8750 -0.8750 -0.8750)
(-55.0 -0.9550 -0.9550 -0.9550 -0.9550 -0.9550 -0.9550 -0.9550 -0.9550)
(-50.0 -1.0200 -1.0200 -1.0200 -1.0200 -1.0200 -1.0200 -1.0200 -1.0200)
(-45.0 -1.0500 -1.0500 -1.0500 -1.0500 -1.0500 -1.0500 -1.0500 -1.0500)
(-40.0 -1.0350 -1.0350 -1.0350 -1.0350 -1.0350 -1.0350 -1.0350 -1.0350)
(-35.0 -0.9800 -0.9800 -0.9800 -0.9800 -0.9800 -0.9800 -0.9800 -0.9800)
(-30.0 -0.8550 -0.8550 -0.8550 -0.8550 -0.8550 -0.8550 -0.8550 -0.8550)
(-25.0 -0.4802 -0.5297 -0.6664 -0.8866 -1.0350 -1.1018 -1.2230 -1.3476)
(-22.0 -0.3345 -0.4091 -0.6023 -0.8453 -0.9940 -1.0644 -1.1893 -1.3130)
(-21.0 -0.2880 -0.3783 -0.5972 -0.8425 -0.9899 -1.0599 -1.1853 -1.3092)
(-20.0 -0.2414 -0.3475 -0.5920 -0.8397 -0.9858 -1.0554 -1.1812 -1.3054)
(-19.0 -0.2017 -0.3348 -0.6009 -0.8443 -0.9885 -1.0571 -1.1797 -1.3066)
(-18.0 -0.1619 -0.3221 -0.6098 -0.8489 -0.9911 -1.0588 -1.1814 -1.3031)
(-17.0 -0.1300 -0.3360 -0.6293 -0.8603 -0.9973 -1.0641 -1.1824 -1.2977)
(-16.0 -0.0981 -0.3499 -0.6487 -0.8717 -1.0056 -1.0690 -1.1823 -1.2860)
(-15.0 -0.0907 -0.3898 -0.6740 -0.8840 -1.0106 -1.0709 -1.1747 -1.2680)
(-14.0 -0.0833 -0.4296 -0.6993 -0.8937 -1.0122 -1.0657 -1.1580 -1.2410)
(-13.0 -0.1247 -0.4762 -0.7255 -0.8973 -1.0020 -1.0492 -1.1305 -1.1979)
(-12.0 -0.1660 -0.5228 -0.7363 -0.8938 -0.9843 -1.0257 -1.0906 -1.1453)
(-11.0 -0.2176 -0.5564 -0.7443 -0.8779 -0.9543 -0.9862 -1.0398 -1.0787)
(-10.0 -0.2691 -0.5780 -0.7374 -0.8500 -0.9091 -0.9364 -0.9739 -1.0049)
(-9.0 -0.3162 -0.5874 -0.7148 -0.8026 -0.8498 -0.8694 -0.8986 -0.9222)
(-8.0 -0.3420 -0.5751 -0.6745 -0.7434 -0.7802 -0.7939 -0.8143 -0.8334)
(-7.0 -0.3427 -0.5445 -0.6209 -0.6728 -0.6988 -0.7102 -0.7254 -0.7354)
(-6.0 -0.3382 -0.4953 -0.5486 -0.5891 -0.6100 -0.6191 -0.6268 -0.6600)
(-5.0 -0.3086 -0.4324 -0.4687 -0.4998 -0.5146 -0.5192 -0.5500 -0.5500)
(-4.0 -0.2730 -0.3564 -0.3800 -0.4044 -0.4128 -0.4400 -0.4400 -0.4400)
(-3.0 -0.2103 -0.2731 -0.2861 -0.3024 -0.3300 -0.3300 -0.3300 -0.3300)
(-2.0 -0.1465 -0.1839 -0.1879 -0.2200 -0.2200 -0.2200 -0.2200 -0.2200)
(-1.0 -0.0752 -0.0921 -0.0842 -0.1100 -0.1100 -0.1100 -0.1100 -0.1100)
(0.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(1.0 0.0752 0.0921 0.0842 0.1100 0.1100 0.1100 0.1100 0.1100)
(2.0 0.1465 0.1839 0.1879 0.2200 0.2200 0.2200 0.2200 0.2200)
(3.0 0.2103 0.2731 0.2861 0.3024 0.3300 0.3300 0.3300 0.3300)
(4.0 0.2730 0.3564 0.3800 0.4044 0.4128 0.4400 0.4400 0.4400)
(5.0 0.3086 0.4324 0.4687 0.4998 0.5146 0.5192 0.5500 0.5500)
(6.0 0.3382 0.4953 0.5486 0.5891 0.6100 0.6191 0.6268 0.6600)
(7.0 0.3427 0.5445 0.6209 0.6728 0.6988 0.7102 0.7254 0.7354)
(8.0 0.3420 0.5751 0.6745 0.7434 0.7802 0.7939 0.8143 0.8334)
(9.0 0.3162 0.5874 0.7148 0.8026 0.8498 0.8694 0.8986 0.9222)
(10.0 0.2691 0.5780 0.7374 0.8500 0.9091 0.9364 0.9739 1.0049)
(11.0 0.2176 0.5564 0.7443 0.8779 0.9543 0.9862 1.0398 1.0787)
(12.0 0.1660 0.5228 0.7363 0.8938 0.9843 1.0257 1.0906 1.1453)
(13.0 0.1247 0.4762 0.7255 0.8973 1.0020 1.0492 1.1305 1.1979)
(14.0 0.0833 0.4296 0.6993 0.8937 1.0122 1.0657 1.1580 1.2410)
(15.0 0.0907 0.3898 0.6740 0.8840 1.0106 1.0709 1.1747 1.2680)
(16.0 0.0981 0.3499 0.6487 0.8717 1.0056 1.0690 1.1823 1.2860)
(17.0 0.1300 0.3360 0.6293 0.8603 0.9973 1.0641 1.1824 1.2977)
(18.0 0.1619 0.3221 0.6098 0.8489 0.9911 1.0588 1.1814 1.3031)
(19.0 0.2017 0.3348 0.6009 0.8443 0.9885 1.0571 1.1797 1.3066)
(20.0 0.2414 0.3475 0.5920 0.8397 0.9858 1.0554 1.1812 1.3054)
(21.0 0.2880 0.3783 0.5972 0.8425 0.9899 1.0599 1.1853 1.3092)
(22.0 0.3345 0.4091 0.6023 0.8453 0.9940 1.0644 1.1893 1.3130)
(25.0 0.4802 0.5297 0.6664 0.8866 1.0350 1.1018 1.2230 1.3476)
(30.0 0.8550 0.8550 0.8550 0.8550 0.8550 0.8550 0.8550 0.8550)
(35.0 0.9800 0.9800 0.9800 0.9800 0.9800 0.9800 0.9800 0.9800)
(40.0 1.0350 1.0350 1.0350 1.0350 1.0350 1.0350 1.0350 1.0350)
(45.0 1.0500 1.0500 1.0500 1.0500 1.0500 1.0500 1.0500 1.0500)
(50.0 1.0200 1.0200 1.0200 1.0200 1.0200 1.0200 1.0200 1.0200)
(55.0 0.9550 0.9550 0.9550 0.9550 0.9550 0.9550 0.9550 0.9550)
(60.0 0.8750 0.8750 0.8750 0.8750 0.8750 0.8750 0.8750 0.8750)
(65.0 0.7600 0.7600 0.7600 0.7600 0.7600 0.7600 0.7600 0.7600)
(70.0 0.6300 0.6300 0.6300 0.6300 0.6300 0.6300 0.6300 0.6300)
(75.0 0.5000 0.5000 0.5000 0.5000 0.5000 0.5000 0.5000 0.5000)
(80.0 0.3650 0.3650 0.3650 0.3650 0.3650 0.3650 0.3650 0.3650)
(85.0 0.2300 0.2300 0.2300 0.2300 0.2300 0.2300 0.2300 0.2300)
(90.0 0.0900 0.0900 0.0900 0.0900 0.0900 0.0900 0.0900 0.0900)
(95.0 -0.0500 -0.0500 -0.0500 -0.0500 -0.0500 -0.0500 -0.0500 -0.0500)
(100.0 -0.1850 -0.1850 -0.1850 -0.1850 -0.1850 -0.1850 -0.1850 -0.1850)
(105.0 -0.3200 -0.3200 -0.3200 -0.3200 -0.3200 -0.3200 -0.3200 -0.3200)
(110.0 -0.4500 -0.4500 -0.4500 -0.4500 -0.4500 -0.4500 -0.4500 -0.4500)
(115.0 -0.5750 -0.5750 -0.5750 -0.5750 -0.5750 -0.5750 -0.5750 -0.5750)
(120.0 -0.6700 -0.6700 -0.6700 -0.6700 -0.6700 -0.6700 -0.6700 -0.6700)
(125.0 -0.7600 -0.7600 -0.7600 -0.7600 -0.7600 -0.7600 -0.7600 -0.7600)
(130.0 -0.8500 -0.8500 -0.8500 -0.8500 -0.8500 -0.8500 -0.8500 -0.8500)
(135.0 -0.9300 -0.9300 -0.9300 -0.9300 -0.9300 -0.9300 -0.9300 -0.9300)
(140.0 -0.9800 -0.9800 -0.9800 -0.9800 -0.9800 -0.9800 -0.9800 -0.9800)
(145.0 -0.9000 -0.9000 -0.9000 -0.9000 -0.9000 -0.9000 -0.9000 -0.9000)
(150.0 -0.7700 -0.7700 -0.7700 -0.7700 -0.7700 -0.7700 -0.7700 -0.7700)
(155.0 -0.6700 -0.6700 -0.6700 -0.6700 -0.6700 -0.6700 -0.6700 -0.6700)
(160.0 -0.6350 -0.6350 -0.6350 -0.6350 -0.6350 -0.6350 -0.6350 -0.6350)
(165.0 -0.6800 -0.6800 -0.6800 -0.6800 -0.6800 -0.6800 -0.6800 -0.6800)
(170.0 -0.8500 -0.8500 -0.8500 -0.8500 -0.8500 -0.8500 -0.8500 -0.8500)
(175.0 -0.6600 -0.6600 -0.6600 -0.6600 -0.6600 -0.6600 -0.6600 -0.6600)
(180.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
