codedFixedValue/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 13.2 -7.8 0) // 0
    ( 13.2  7.8 0) // 1
    ( -21.6   7.8 0) // 2
    ( -21.6  -7.8 0) // 3
    ( 13.2 -7.8  25) // 4
    ( 13.2  7.8  25) // 5
    ( -21.6   7.8  25) // 6
    ( -21.6  -7.8  25) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (64 32 64)
    simpleGrading 
    (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 6 7 3)
        );
    }

    outlet
    {
	type patch;
	faces
        (
            (0 4 5 1)
        );
    }

    walls
    {
	type wall;
        faces
        (
            (1 5 6 2)
            (4 0 3 7)
        );
    }

    top
    {
	type wall;
	faces
        (
            (4 7 6 5)
        );
    }

    bottom
    {
	type wall;
        faces
        (
            (0 1 2 3)
        );
    }
);

edges
(
);

mergePatchPairs
(
);

// ************************************************************************* //
