codedFixedValue/system/controlDict.recovery
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "controlDict"
#inputMode overwrite

functions
{
    readFields
    {
        functionObjectLibs ("libfieldFunctionObjects.so");
        type            readFields;
        fields          (pMean UMean kMean);
    }

    recoveryTerms
    {
        functionObjectLibs ("libutilityFunctionObjects.so");
        type coded;
        // Name of on-the-fly generated functionObject
        redirectType writeRecoveryTerms;
        codeEnd
        #{
            const volVectorField& UMean
                = mesh().lookupObject<volVectorField>("UMean");
            const volScalarField UMeanX = UMean.component(0);
            const volScalarField& pMean
                = mesh().lookupObject<volScalarField>("pMean");

            volVectorField gradPMean = fvc::grad(pMean);

            volScalarField gradPMeanX
            (
                IOobject
                (
                    "gradPMeanX",
                    mesh().time().timeName(),
                    mesh(),
                    IOobject::NO_READ,
                    IOobject::AUTO_WRITE
                ),
                gradPMean.component(0)
            );

            volVectorField gradUMeanX
            (
                IOobject
                (
                    "gradUMeanX",
                    mesh().time().timeName(),
                    mesh(),
                    IOobject::NO_READ,
                    IOobject::AUTO_WRITE
                ),
                fvc::grad(UMeanX)
            );

            volScalarField laplacianUMeanX
            (
                IOobject
                (
                    "laplacianUMeanX",
                    mesh().time().timeName(),
                    mesh(),
                    IOobject::NO_READ,
                    IOobject::AUTO_WRITE
                ),
                fvc::laplacian(UMeanX)
            );

            gradPMeanX.write();
            gradUMeanX.write();
            laplacianUMeanX.write();
        #};
    }
}

// ************************************************************************* //
